Revit 2027 API
BuiltInFailures.CurtainWallFailures.CurtainGridOffHost Property
 Curtain grid has left its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurtainGridOffHost { get; }
Public Shared ReadOnly Property CurtainGridOffHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurtainGridOffHost {
	FailureDefinitionId^ get ();
}
static member CurtainGridOffHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace